config/system.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-21 Mon 03:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guix System Configuration</title>
<meta name="author" content="nouun" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Guix System Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org702ca8c">1. Guix Channels</a>
<ul>
<li><a href="#orge7be3da">1.1. nonguix</a></li>
<li><a href="#org7e3221c">1.2. rde</a></li>
<li><a href="#org306ae2c">1.3. Base Channels</a></li>
</ul>
</li>
<li><a href="#orgcaa52c6">2. Base System</a>
<ul>
<li><a href="#orgf3cf98e">2.1. Packages</a></li>
<li><a href="#orgfaaef73">2.2. Services</a></li>
<li><a href="#org3bfce78">2.3. Users</a></li>
<li><a href="#org8453ca4">2.4. Base System</a></li>
</ul>
</li>
<li><a href="#org77a74ca">3. Machines</a>
<ul>
<li><a href="#org8d8b1d4">3.1. Verrb (MacBook Pro)</a>
<ul>
<li><a href="#org4b914ea">3.1.1. Packages</a></li>
<li><a href="#org6f08e8c">3.1.2. Services</a></li>
<li><a href="#org1468304">3.1.3. System</a></li>
</ul>
</li>
<li><a href="#org050f3d1">3.2. Pronouun (Server)</a>
<ul>
<li><a href="#org915dec4">3.2.1. Packages</a></li>
<li><a href="#org3f6821a">3.2.2. Services</a></li>
<li><a href="#org5a023bc">3.2.3. Users</a></li>
<li><a href="#org66608fb">3.2.4. System</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org702ca8c" class="outline-2">
<h2 id="org702ca8c"><span class="section-number-2">1.</span> Guix Channels</h2>
<div class="outline-text-2" id="text-1">
<p>
Guix uses <a href="https://guix.gnu.org/manual/en/html_node/Channels.html">channels</a>
which are basically git repositories containing Guile files
defining Guix packages that can be installed on your system.
</p>
</div>


<div id="outline-container-orge7be3da" class="outline-3">
<h3 id="orge7be3da"><span class="section-number-3">1.1.</span> nonguix</h3>
<div class="outline-text-3" id="text-1-1">
<p>
As my current laptop uses a WiFi chip which doesn't have a
supported libre driver and Guix is a
<a href="https://www.gnu.org/distros/free-system-distribution-guidelines.html">free system</a>
so we have to add the
<a href="https://gitlab.com/nonguix/nonguix">nonguix</a> channel to use the non-free Linux kernel.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define nonguix
  (channel
    (name 'nonguix)
    (url "https://gitlab.com/nonguix/nonguix")
    (introduction
      (make-channel-introduction
	"897c1a470da759236cc11798f4e0a5f7d4d59fbc"
	(openpgp-fingerprint
	  "2A39 3FFF 68F4 EF7A 3D29  12AF 6F51 20A0 22FB B2D5")))))
</pre>
</div>
</div>
</div>


<div id="outline-container-org7e3221c" class="outline-3">
<h3 id="org7e3221c"><span class="section-number-3">1.2.</span> rde</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://git.sr.ht/~abcdw/rde">rde</a> is an extension on top of Guix home which
adds additional services for configuring the home environment
and operating system.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define rde
  (channel
    (name 'rde)
    (url "https://git.sr.ht/~abcdw/rde")
    (introduction
      (make-channel-introduction
	"257cebd587b66e4d865b3537a9a88cccd7107c95"
	(openpgp-fingerprint
	  "2841 9AC6 5038 7440 C7E9  2FFA 2208 D209 58C1 DEB0")))))
</pre>
</div>
</div>
</div>


<div id="outline-container-org306ae2c" class="outline-3">
<h3 id="org306ae2c"><span class="section-number-3">1.3.</span> Base Channels</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Return all the channels including the base channels which has
the main Guix channel.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(cons* nonguix
       rde
       %default-channels)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgcaa52c6" class="outline-2">
<h2 id="orgcaa52c6"><span class="section-number-2">2.</span> Base System</h2>
<div class="outline-text-2" id="text-2">
<p>
This configuration is (will be) shared between different
computers and as such they share the same base services,
packages, and system.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-module (jayu build system base)
  #:use-module (gnu)
  #:use-module (gnu packages)
  #:use-module (gnu system)
  #:use-module (gnu packages bash)
  #:use-module (gnu packages shells))
</pre>
</div>
</div>


<div id="outline-container-orgf3cf98e" class="outline-3">
<h3 id="orgf3cf98e"><span class="section-number-3">2.1.</span> Packages</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Define some basic system agnostic packages to include in all
machines.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-public jayu-base-packages
  (append
    (map (compose list specification-&gt;package+output)
    '("curl" "dbus" "emacs" "gash" "git" "gnupg"
      "guile-readline" "ncurses" "nss-certs" "openssh"
      "wget" "vim" "xdg-user-dirs" "xdg-utils"))
    %base-packages))
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfaaef73" class="outline-3">
<h3 id="orgfaaef73"><span class="section-number-3">2.2.</span> Services</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Define a service which adds coreutils to <code>/usr/bin/env</code>,
Bash to <code>/bin/bash</code>, and Dash to <code>/bin/sh</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-public jayu-file-services
  (list
    (extra-special-file "/usr/bin/env"
			(file-append coreutils "/usr/bin/env"))
    (extra-special-file "/bin/bash"
			(file-append bash "/bin/bash"))
    (extra-special-file "/bin/sh"
			(file-append dash "/bin/sh"))))
</pre>
</div>
</div>
</div>


<div id="outline-container-org3bfce78" class="outline-3">
<h3 id="org3bfce78"><span class="section-number-3">2.3.</span> Users</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Define a list of users which will be on all machines.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define jayu-users
  (list
    (user-account
     (name "nouun")
     (comment "nouun")
     (home-directory "/home/nouun")
     (group "users")
     (supplementary-groups
       '("wheel" "netdev" "audio" "video"))
     (shell (file-append bash "/bin/bash")))))

(define-public jayu-base-users
  (append
     jayu-users
     %base-user-accounts))
</pre>
</div>
</div>
</div>


<div id="outline-container-org8453ca4" class="outline-3">
<h3 id="org8453ca4"><span class="section-number-3">2.4.</span> Base System</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Define a base system which is inherited and updated in each
specific machine configuration.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-public jayu-base-system
  (operating-system
    (locale "en_NZ.utf8")
    (timezone "Pacific/Auckland")
    (host-name "guix")

    (users jayu-base-users)
    (packages jayu-base-packages)
    (services jayu-file-services)

    (bootloader
      (bootloader-configuration
	(bootloader grub-efi-bootloader)
	(targets (list "/boot/efi"))))

    ;; Guix requires file-system to be defined to create an operating-system
    ;; so pass through a dummy file system which will be overriden in each
    ;; machine configuration.
    (file-systems
      (cons* (file-system
	       (mount-point "/")
	       (device "none")
	       (type "ext4")
	       (check? #f))
	     %base-file-systems))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org77a74ca" class="outline-2">
<h2 id="org77a74ca"><span class="section-number-2">3.</span> Machines</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8d8b1d4" class="outline-3">
<h3 id="org8d8b1d4"><span class="section-number-3">3.1.</span> Verrb (MacBook Pro)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Verrb is the configuration that is used on my Macbook Pro.
Being an Apple Macbook, it uses a nonfree WiFi chip and as
such, the non-free Linux kernel and b43 firmware are required
to get WiFi working.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-module (jayu build system verrb)
  #:use-module (gnu)
  #:use-module (gnu packages bash)
  #:use-module (gnu packages firmware)
  #:use-module (gnu packages messaging)
  #:use-module (gnu system)
  #:use-module (gnu services desktop)
  #:use-module (gnu services dns)
  #:use-module (gnu services networking)
  #:use-module (gnu services messaging)
  #:use-module (gnu services sddm)
  #:use-module (gnu services ssh)
  #:use-module (gnu services web)
  #:use-module (gnu services xorg)
  #:use-module (guix store)
  #:use-module (srfi srfi-1)

  ; Nonfree packages: linux, b43-firmware 
  #:use-module (nongnu packages linux)
  #:use-module (jayu packages nonfree)

  #:use-module (jayu build system base)
  #:use-module (jayu packages display-managers)
  #:use-module (jayu packages extras)
  #:use-module (jayu packages rust-apps))
</pre>
</div>
</div>
