config/system.org
*** Packages

Define packages specific to Verrb. =alsa-utils= and
=pulseaudio= are used for audio. My AwesomeWM configuration
requires an upstream version, therefore =awesome-git= is used
instead of the packaged version included in the Guix repos.
=verrb-sddm-theme= is the SDDM theme that I made and use.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/verrb.scm
  (define verrb-packages
    (append
     (list awesome-git
	   adverrb-sddm-theme)
     (map (compose list specification->package+output)
	  '("alsa-utils" "pulseaudio"))
     jayu-base-packages))
#+END_SRC


*** Services

**** SDDM

This will install SDDM as the display manager and use the
verrb theme.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/verrb.scm
  (define verrb-sddm-service
    (service sddm-service-type
             (sddm-configuration
              (theme "verrb"))))
#+END_SRC


**** Bitlbee

Enable Bitlbee and install the Discord plugin so we can
interact with Discord without having to use the bloated
electron client.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/verrb.scm
  (define verrb-bitlbee-service
    (service bitlbee-service-type
	     (bitlbee-configuration
	       (plugins
	         (list bitlbee-discord)))))
#+END_SRC


**** Desktop Services

Modify the default desktop services to do the following:

1) Remove GDM as SDDM is used instead.
2) Set Guix to always use 4 cores.
3) Stop network-manager from modifying /etc/resolve.conf

To use the Nonguix substitute server, we need to modify
the guix service and add the substitute server as well as
the signing key.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/verrb.scm
  (define verrb-desktop-services
     (modify-services
       (remove (lambda (service)
		(eq? (service-kind service) gdm-service-type))
	   %desktop-services)

       (guix-service-type
	 config => (guix-configuration
		    (inherit config)
		    (extra-options '("--max-job=4"))
                    (substitute-urls
                     (append %default-substitute-urls
                       (list "https://substitutes.nonguix.org")))
                    (authorized-keys
                     (append %default-authorized-guix-keys
                       (list (local-file "../nonguix-key.pub"))))))

       (network-manager-service-type
	 config => (network-manager-configuration
		    (inherit config)
		    (dns "none")))))
#+END_SRC

**** Verrb Services

Append all services into a single list.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/verrb.scm
  (define verrb-services
    (append (list verrb-sddm-service
                  verrb-bitlbee-service)
            verrb-desktop-services
            jayu-file-services))
#+END_SRC


*** System


**** File System

Mount root and boot partitions.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/verrb.scm
  (define verrb-file-system
    (cons* (file-system
             (mount-point "/")
             (device
               (uuid "e66d5096-1a1a-420d-92f0-b01cf7d103ea"
                     'ext4))
             (type "ext4"))
           (file-system
             (mount-point "/boot/efi")
             (device (uuid "A23F-3C5F" 'fat32))
             (type "vfat"))
           %base-file-systems))
#+END_SRC


**** System

Return a new operating system which inherits the
=jayu-base-system= created in the base configuration and
passes through the variables we've already defined. As
mentioned at the start, this machine requires the
non-free Linux kernel and b43-firmware so we also set
those.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/verrb.scm
  (operating-system
    (inherit jayu-base-system)
    (host-name "verrb")
    (users jayu-base-users)
    (file-systems verrb-file-system)
  
    (packages verrb-packages)
    (services verrb-services)

    (kernel linux)
    (firmware (list b43-firmware)))
#+END_SRC


** Pronouun (Server)

Pronouun is the configuration that is used on the server which
hosts my website and git frontend.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (define-module (jayu build system pronouun)
    #:use-module (gnu)
    #:use-module (gnu packages bash)
    #:use-module (gnu packages firmware)
    #:use-module (gnu packages messaging)
    #:use-module (gnu system)
    #:use-module (gnu services dns)
    #:use-module (gnu services networking)
    #:use-module (gnu services messaging)
    #:use-module (gnu services ssh)
    #:use-module (gnu services web)
    #:use-module (guix store)
    #:use-module (srfi srfi-1)
    #:use-module (jayu build system base))
#+END_SRC

*** Packages

Define packages specific to Pronouun.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (use-package-modules certs tls)
  
  (define pronouun-packages
    (append
     (list nss-certs
	   certbot)
     jayu-base-packages))
#+END_SRC


*** Services

Mainly just git and website services

**** Git Daemon

Git Daemon

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (use-service-modules version-control)
  
  (define pronouun-git-daemon-service
    (service git-daemon-service-type))
;	     (git-daemon-configuration)))
;	      (base-path "/home/git/repositories/"))))
#+END_SRC


**** FastCGI

Fast CGI

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (define pronouun-fcgi-service
    (service fcgiwrap-service-type))
#+END_SRC


**** Cgit

Git frontend

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (use-service-modules cgit)
  (use-package-modules version-control)

  (define (cert-path host file)
    (format #f "/etc/letsencrypt/live/~a/~a.pem"
            host (symbol->string file)))
  
  (define pronouun-cgit-nginx-configuration
    (nginx-server-configuration
     (root cgit)
     (server-name '("git.nouun.dev"
		    "www.git.nouun.dev"))
     (listen '("80"))
     (locations
      (list
       (nginx-location-configuration
	(uri "@cgit")
	(body '("fastcgi_param SCRIPT_FILENAME $document_root/lib/cgit/cgit.cgi;"
		"fastcgi_param PATH_INFO $uri;"
		"fastcgi_param QUERY_STRING $args;"
		"fastcgi_param HTTP_HOST $server_name;"
		"fastcgi_pass 127.0.0.1:9000;")))))
     (try-files (list "$uri" "@cgit"))
     (ssl-certificate (cert-path "git.nouun.dev"
                      'fullchain))
     (ssl-certificate-key (cert-path "git.karl.hallsby.com"
                          'privkey))))

  (define pronouun-cgit-service
    (service cgit-service-type
	     (cgit-configuration
	      (enable-commit-graph? #t)
	      (enable-html-serving? #t)
	      (repository-directory "/home/cgit/repositories")
	      (nocache? #t)
	      (nginx
               (list
                 pronouun-cgit-nginx-configuration)))))
#+END_SRC

