config/system.html


<div id="outline-container-org4b914ea" class="outline-4">
<h4 id="org4b914ea"><span class="section-number-4">3.1.1.</span> Packages</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Define packages specific to Verrb. <code>alsa-utils</code> and
<code>pulseaudio</code> are used for audio. My AwesomeWM configuration
requires an upstream version, therefore <code>awesome-git</code> is used
instead of the packaged version included in the Guix repos.
<code>verrb-sddm-theme</code> is the SDDM theme that I made and use.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define verrb-packages
  (append
   (list awesome-git
	 verrb-sddm-theme)
   (map (compose list specification-&gt;package+output)
	'("alsa-utils" "pulseaudio"))
   jayu-base-packages))
</pre>
</div>
</div>
</div>


<div id="outline-container-org6f08e8c" class="outline-4">
<h4 id="org6f08e8c"><span class="section-number-4">3.1.2.</span> Services</h4>
<div class="outline-text-4" id="text-3-1-2">
</div>
<ol class="org-ol">
<li><a id="org2be2154"></a>SDDM<br />
<div class="outline-text-5" id="text-3-1-2-1">
<p>
This will install SDDM as the display manager and use the
verrb theme.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define verrb-sddm-service
  (service sddm-service-type
	   (sddm-configuration
	    (theme "verrb"))))
</pre>
</div>
</div>
</li>


<li><a id="orgc51a4e0"></a>Bitlbee<br />
<div class="outline-text-5" id="text-3-1-2-2">
<p>
Enable Bitlbee and install the Discord plugin so we can
interact with Discord without having to use the bloated
electron client.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define verrb-bitlbee-service
  (service bitlbee-service-type
	   (bitlbee-configuration
	     (plugins
	       (list bitlbee-discord)))))
</pre>
</div>
</div>
</li>


<li><a id="orgd05bc24"></a>Desktop Services<br />
<div class="outline-text-5" id="text-3-1-2-3">
<p>
Modify the default desktop services to do the following:
</p>

<ol class="org-ol">
<li>Remove GDM as SDDM is used instead.</li>
<li>Set Guix to always use 4 cores.</li>
<li>Stop network-manager from modifying /etc/resolve.conf</li>
</ol>

<div class="org-src-container">
<pre class="src src-scheme">(define verrb-desktop-services
   (modify-services
     (remove (lambda (service)
	      (eq? (service-kind service) gdm-service-type))
	 %desktop-services)

     (guix-service-type
       config =&gt; (guix-configuration
		  (inherit config)
		  (extra-options '("--max-job=4"))))

     (network-manager-service-type
       config =&gt; (network-manager-configuration
		  (inherit config)
		  (dns "none")))))
</pre>
</div>
</div>
</li>


<li><a id="org376a866"></a>Verrb Services<br />
<div class="outline-text-5" id="text-3-1-2-4">
<p>
Append all services into a single list.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define verrb-services
  (append (list verrb-sddm-service
		verrb-bitlbee-service)
	  verrb-desktop-services
	  jayu-file-services))
</pre>
</div>
</div>
</li>
</ol>
</div>


<div id="outline-container-org1468304" class="outline-4">
<h4 id="org1468304"><span class="section-number-4">3.1.3.</span> System</h4>
<div class="outline-text-4" id="text-3-1-3">
</div>
<ol class="org-ol">
<li><a id="org2594ce9"></a>File System<br />
<div class="outline-text-5" id="text-3-1-3-1">
<p>
Mount root and boot partitions.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define verrb-file-system
  (cons* (file-system
	   (mount-point "/")
	   (device
	     (uuid "e66d5096-1a1a-420d-92f0-b01cf7d103ea"
		   'ext4))
	   (type "ext4"))
	 (file-system
	   (mount-point "/boot/efi")
	   (device (uuid "A23F-3C5F" 'fat32))
	   (type "vfat"))
	 %base-file-systems))
</pre>
</div>
</div>
</li>


<li><a id="orgae04204"></a>System<br />
<div class="outline-text-5" id="text-3-1-3-2">
<p>
Return a new operating system which inherits the
<code>jayu-base-system</code> created in the base configuration and
passes through the variables we've already defined. As
mentioned at the start, this machine requires the
non-free Linux kernel and b43-firmware so we also set
those.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(operating-system
  (inherit jayu-base-system)
  (host-name "verrb")
  (users jayu-base-users)
  (file-systems verrb-file-system)

  (packages verrb-packages)
  (services verrb-services)

  (kernel linux)
  (firmware (list b43-firmware)))
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org050f3d1" class="outline-3">
<h3 id="org050f3d1"><span class="section-number-3">3.2.</span> Pronouun (Server)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Pronouun is the configuration that is used on the server which
hosts my website and git frontend.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define-module (jayu build system pronouun)
  #:use-module (gnu)
  #:use-module (gnu packages bash)
  #:use-module (gnu packages firmware)
  #:use-module (gnu packages messaging)
  #:use-module (gnu system)
  #:use-module (gnu services dns)
  #:use-module (gnu services networking)
  #:use-module (gnu services messaging)
  #:use-module (gnu services ssh)
  #:use-module (gnu services web)
  #:use-module (guix store)
  #:use-module (srfi srfi-1)
  #:use-module (jayu build system base))
</pre>
</div>
</div>

<div id="outline-container-org915dec4" class="outline-4">
<h4 id="org915dec4"><span class="section-number-4">3.2.1.</span> Packages</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Define packages specific to Pronouun.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(use-package-modules certs tls)

(define pronouun-packages
  (append
   (list nss-certs
	 certbot)
   jayu-base-packages))
</pre>
</div>
</div>
</div>


<div id="outline-container-org3f6821a" class="outline-4">
<h4 id="org3f6821a"><span class="section-number-4">3.2.2.</span> Services</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Mainly just git and website services
</p>
</div>

<ol class="org-ol">
<li><a id="orgfd7a31f"></a>Git Daemon<br />
<div class="outline-text-5" id="text-3-2-2-1">
<p>
Git Daemon
</p>

<div class="org-src-container">
<pre class="src src-scheme">  (use-service-modules version-control)

  (define pronouun-git-daemon-service
    (service git-daemon-service-type))
;	     (git-daemon-configuration)))
;	      (base-path "/home/git/repositories/"))))
</pre>
</div>
</div>
</li>


<li><a id="orgc6200be"></a>FastCGI<br />
<div class="outline-text-5" id="text-3-2-2-2">
<p>
Fast CGI
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define pronouun-fcgi-service
  (service fcgiwrap-service-type))
</pre>
</div>
</div>
</li>


<li><a id="org8a4aea7"></a>Cgit<br />
<div class="outline-text-5" id="text-3-2-2-3">
<p>
Git frontend
</p>

<div class="org-src-container">
<pre class="src src-scheme">(use-service-modules cgit)
(use-package-modules version-control)

(define (cert-path host file)
  (format #f "/etc/letsencrypt/live/~a/~a.pem"
	  host (symbol-&gt;string file)))

(define pronouun-cgit-nginx-configuration
  (nginx-server-configuration
   (root cgit)
   (server-name '("git.nouun.dev"
		  "www.git.nouun.dev"))
   (listen '("80"))
   (locations
    (list
     (nginx-location-configuration
      (uri "@cgit")
      (body '("fastcgi_param SCRIPT_FILENAME $document_root/lib/cgit/cgit.cgi;"
	      "fastcgi_param PATH_INFO $uri;"
	      "fastcgi_param QUERY_STRING $args;"
	      "fastcgi_param HTTP_HOST $server_name;"
	      "fastcgi_pass 127.0.0.1:9000;")))))
   (try-files (list "$uri" "@cgit"))
   (ssl-certificate (cert-path "git.nouun.dev"
		    'fullchain))
   (ssl-certificate-key (cert-path "git.karl.hallsby.com"
			'privkey))))

(define pronouun-cgit-service
  (service cgit-service-type
	   (cgit-configuration
	    (enable-commit-graph? #t)
	    (enable-html-serving? #t)
	    (repository-directory "/home/cgit/repositories")
	    (nocache? #t)
	    (nginx
	     (list
	       pronouun-cgit-nginx-configuration)))))
</pre>
</div>
</div>
</li>
