config/system.org
**** Nginx

nginx

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (use-service-modules web)

  (define pronouun-website-nginx-configuration
    (nginx-server-configuration
     (server-name '("nouun.dev"
		    "www.nouun.dev"))
     (listen '("80"))))
     ;(ssl-certificate (cert-path "git.nouun.dev"
     ;                 'fullchain))
     ;(ssl-certificate-key (cert-path "git.karl.hallsby.com"
     ;                     'privkey))))

  (define pronouun-nginx-service
    (service nginx-service-type
	     (nginx-configuration
	      (server-blocks
	       (list pronouun-website-nginx-configuration)))))
#+END_SRC


**** Certbot

certbot

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (use-service-modules certbot)

  (define pronouun-certbot-nginx-deploy-hook
    (program-file
     "nginx-deploy-hook"
      #~(let ((pid (call-with-input-file "/var/run/nginx/pid" read)))
          (kill pid SIGHUP))))

  (define pronouun-certbot-service
    (service certbot-service-type
	     (certbot-configuration
	      (email "me@nouun.dev")
	      (certificates
	       (list
		(certificate-configuration
		 (name "Website")
		 (domains '("nouun.dev"
			    "www.nouun.dev"))
                 (deploy-hook
                    pronouun-certbot-nginx-deploy-hook))
		(certificate-configuration
		 (name "Website")
		 (domains '("git.nouun.dev"
			    "www.git.nouun.dev"))
                 (deploy-hook
                    pronouun-certbot-nginx-deploy-hook)))))))
#+END_SRC


**** DHCP

dhcp

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (use-service-modules networking)
  
  (define pronouun-dhcp-service
    (service dhcp-client-service-type))
#+END_SRC

**** OpenSSH

I use =openssh-sans-x= as there is no X11 server setup and
as such, OpenSSH doesn't need X11 support.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (use-service-modules ssh)
  (use-package-modules ssh)
  
  (define pronouun-ssh-service
    (service openssh-service-type
             (openssh-configuration
              (openssh openssh-sans-x)
              (password-authentication? #t)
              (permit-root-login #f))))
#+END_SRC


**** Base Services

Modify the default base services to do the following:

1) Nothing for now

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (define pronouun-base-services
    (append
     jayu-file-services
     %base-services))
#+END_SRC


**** Pronouun Services

Append all services into a single list.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (define pronouun-services
    (append (list pronouun-git-daemon-service
                  pronouun-fcgi-service
                  pronouun-cgit-service
                  pronouun-nginx-service
                  pronouun-certbot-service
                  pronouun-dhcp-service
                  pronouun-ssh-service)
            pronouun-base-services
            jayu-file-services))
#+END_SRC


*** Users

Users

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (define pronouun-users
    (list
      (user-account
       (name "git")
       (comment "git")
       (home-directory "/home/git")
       (group "users")
       (supplementary-groups
	 '("wheel" "netdev" "audio" "video"))
       (shell (file-append bash "/bin/bash")))))
#+END_SRC


*** System


**** File System

Mount root and boot partitions.

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (define pronouun-swap
    (list (uuid "61c2aeba-85ed-4e02-a227-027ecbd115f0")))

  (define pronouun-file-system
    (cons* (file-system
	     (mount-point "/")
	     (device
	       (uuid "b2b07395-cfd5-4133-86e2-5538eb0c0406"
		     'ext4))
	     (type "ext4"))
	   %base-file-systems))
#+END_SRC


**** System

Test

#+BEGIN_SRC scheme :tangle ../jayu/build/system/pronouun.scm
  (operating-system
      (inherit jayu-base-system)
      (host-name "pronouun")
      (users pronouun-users)
      (file-systems pronouun-file-system)

      (packages pronouun-packages)
      (services pronouun-services)

      (bootloader
	(bootloader-configuration
	  (bootloader grub-bootloader)
	  (targets (list "/dev/vda")))))
#+END_SRC
