config/system.html

<li><a id="orgbae6115"></a>Nginx<br />
<div class="outline-text-5" id="text-3-2-2-4">
<p>
nginx
</p>

<div class="org-src-container">
<pre class="src src-scheme">(use-service-modules web)

(define pronouun-website-nginx-configuration
  (nginx-server-configuration
   (server-name '("nouun.dev"
		  "www.nouun.dev"))
   (listen '("80"))))
   ;(ssl-certificate (cert-path "git.nouun.dev"
   ;                 'fullchain))
   ;(ssl-certificate-key (cert-path "git.karl.hallsby.com"
   ;                     'privkey))))

(define pronouun-nginx-service
  (service nginx-service-type
	   (nginx-configuration
	    (server-blocks
	     (list pronouun-website-nginx-configuration)))))
</pre>
</div>
</div>
</li>


<li><a id="org2b76b32"></a>Certbot<br />
<div class="outline-text-5" id="text-3-2-2-5">
<p>
certbot
</p>

<div class="org-src-container">
<pre class="src src-scheme">(use-service-modules certbot)

(define pronouun-certbot-nginx-deploy-hook
  (program-file
   "nginx-deploy-hook"
    #~(let ((pid (call-with-input-file "/var/run/nginx/pid" read)))
	(kill pid SIGHUP))))

(define pronouun-certbot-service
  (service certbot-service-type
	   (certbot-configuration
	    (email "me@nouun.dev")
	    (certificates
	     (list
	      (certificate-configuration
	       (name "Website")
	       (domains '("nouun.dev"
			  "www.nouun.dev"))
	       (deploy-hook
		  pronouun-certbot-nginx-deploy-hook))
	      (certificate-configuration
	       (name "Website")
	       (domains '("git.nouun.dev"
			  "www.git.nouun.dev"))
	       (deploy-hook
		  pronouun-certbot-nginx-deploy-hook)))))))
</pre>
</div>
</div>
</li>


<li><a id="org3996a35"></a>DHCP<br />
<div class="outline-text-5" id="text-3-2-2-6">
<p>
dhcp
</p>

<div class="org-src-container">
<pre class="src src-scheme">(use-service-modules networking)

(define pronouun-dhcp-service
  (service dhcp-client-service-type))
</pre>
</div>
</div>
</li>

<li><a id="orgf06094a"></a>OpenSSH<br />
<div class="outline-text-5" id="text-3-2-2-7">
<p>
I use <code>openssh-sans-x</code> as there is no X11 server setup and
as such, OpenSSH doesn't need X11 support.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(use-service-modules ssh)
(use-package-modules ssh)

(define pronouun-ssh-service
  (service openssh-service-type
	   (openssh-configuration
	    (openssh openssh-sans-x)
	    (password-authentication? #t)
	    (permit-root-login #f))))
</pre>
</div>
</div>
</li>


<li><a id="orge3d3460"></a>Base Services<br />
<div class="outline-text-5" id="text-3-2-2-8">
<p>
Modify the default base services to do the following:
</p>

<ol class="org-ol">
<li>Nothing for now</li>
</ol>

<div class="org-src-container">
<pre class="src src-scheme">(define pronouun-base-services
  (append
   jayu-file-services
   %base-services))
</pre>
</div>
</div>
</li>


<li><a id="orgbfada85"></a>Pronouun Services<br />
<div class="outline-text-5" id="text-3-2-2-9">
<p>
Append all services into a single list.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define pronouun-services
  (append (list pronouun-git-daemon-service
		pronouun-fcgi-service
		pronouun-cgit-service
		pronouun-nginx-service
		pronouun-certbot-service
		pronouun-dhcp-service
		pronouun-ssh-service)
	  pronouun-base-services
	  jayu-file-services))
</pre>
</div>
</div>
</li>
</ol>
</div>


<div id="outline-container-org5a023bc" class="outline-4">
<h4 id="org5a023bc"><span class="section-number-4">3.2.3.</span> Users</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Users
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define pronouun-users
  (list
    (user-account
     (name "git")
     (comment "git")
     (home-directory "/home/git")
     (group "users")
     (supplementary-groups
       '("wheel" "netdev" "audio" "video"))
     (shell (file-append bash "/bin/bash")))))
</pre>
</div>
</div>
</div>


<div id="outline-container-org66608fb" class="outline-4">
<h4 id="org66608fb"><span class="section-number-4">3.2.4.</span> System</h4>
<div class="outline-text-4" id="text-3-2-4">
</div>
<ol class="org-ol">
<li><a id="orgd954e45"></a>File System<br />
<div class="outline-text-5" id="text-3-2-4-1">
<p>
Mount root and boot partitions.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(define pronouun-swap
  (list (uuid "61c2aeba-85ed-4e02-a227-027ecbd115f0")))

(define pronouun-file-system
  (cons* (file-system
	   (mount-point "/")
	   (device
	     (uuid "b2b07395-cfd5-4133-86e2-5538eb0c0406"
		   'ext4))
	   (type "ext4"))
	 %base-file-systems))
</pre>
</div>
</div>
</li>


<li><a id="org7966304"></a>System<br />
<div class="outline-text-5" id="text-3-2-4-2">
<p>
Test
</p>

<div class="org-src-container">
<pre class="src src-scheme">(operating-system
    (inherit jayu-base-system)
    (host-name "pronouun")
    (users pronouun-users)
    (file-systems pronouun-file-system)

    (packages pronouun-packages)
    (services pronouun-services)

    (bootloader
      (bootloader-configuration
	(bootloader grub-bootloader)
	(targets (list "/boot/vda")))))
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nouun</p>
<p class="date">Created: 2022-03-21 Mon 03:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
